#include "Menu.h"

#include<iostream>

using namespace std;

void Menu::PrintMenu()
{
	cout << "******************************************************" << endl
		<< "	1.bmp图片处理(RGB分离，灰度化，反色)" << endl
		<< "	2.直方图处理 " << endl
		<< "	3.空间滤波" << endl
		<< "	4.图像变换" << endl
		<< "	5.阈值分割" << endl
		<< "	6.基于区域的分割（种子增长，区域分裂合并）" << endl
		<< "	7.边缘检测 " << endl
		<< "	8.Hough变换 " << endl
		<< "	9.区域标记与轮廓提取" << endl
		<< "	10.自动执行所有功能" << endl
		<< "*******************************************************" << endl
		<< "请选择功能:" << endl
		<< " " << endl;
}
